# backend/capabilities/vania_doctor/forms/constants.py

OPTS_YES_NO = ["بله", "خیر"]

OPTS_SCORING_0_4 = [
    "0 - اصلاً / خیلی کم",
    "1 - کم",
    "2 - متوسط",
    "3 - زیاد",
    "4 - خیلی زیاد"
]

OPTS_MSE_MOOD = [
    "غمگین (Sad)", "مایوس (Despairing)", "خوشحال (Happy)", 
    "افسرده (Depressed)", "بی تفاوت (Indifferent)", "مضطرب (Anxious)", 
    "پرتنش (Tense)", "بیزار (Hostile)", "شرمسار (Ashamed)", 
    "سرخوش (Euphoric)", "پژمرده (Apathetic)", "خود بزرگ بین (Grandise)"
]

OPTS_MSE_AFFECT = [
    "کند (Blunted)", "سطحی (Flat)", "نامناسب (Inappropriate)", 
    "بی ثبات (Labile)", "متناسب با محتوا (Appropriate)"
]

OPTS_JOB_STATUS = [
    "شاغل", "حالت اشتغال", "خانه دار", "بازنشسته", "بیکار", "سایر"
]

OPTS_MARITAL_STATUS = [
    "مجرد", "نامزد", "عقد", "متاهل", "متارکه", "مطلقه", "بیوه"
]

OPTS_HOUSING = [
    "مالک", "مستاجر", "همراه با والدین", "سایر"
]

OPTS_EDUCATION = [
    "زیر سن آموزش رسمی", "بی سواد", "پیش دبستانی", "ابتدایی", 
    "راهنمایی", "دبیرستان", "دیپلم و پیش دانشگاهی", 
    "دانشجو", "دارای مدرک دانشگاهی", "دارای مدرک حوزوی"
]

OPTS_MILITARY = [
    "آماده به خدمت", "در حین خدمت", "پایان خدمت", "معاف از خدمت"
]

OPTS_REFERRAL = [
    "روزنامه", "۱۱۸", "سایت", "بروشور یا پوستر", 
    "کلاس‌های آموزش خانواده", "سخنرانی‌ها", "پیامک", 
    "سایر مراجعان", "سایر موارد"
]

OPTS_GAF_SCORE = [
    "100-91: کارکرد عالی، بدون علائم",
    "90-81: علائم جزئی، عملکرد خوب",
    "80-71: علائم گذرا و افت خفیف در عملکرد",
    "70-61: علائم خفیف و عملکرد نسبتاً خوب",
    "60-51: علائم متوسط یا اختلال متوسط در عملکرد",
    "50-41: علائم جدی یا اختلال جدی در عملکرد",
    "40-31: اختلال نسبی در واقعیت‌سنجی یا چند حوزه عملکرد",
    "30-21: هذیان/توهم یا ناتوانی جدی در تقریباً همه حوزه‌ها",
    "20-11: خطر نسبی برای خود یا دیگران",
    "10-1: خطر دائم برای خود یا دیگران",
    "0: اطلاعات ناکافی",
]
