OPTS_JOB_STATUS = [
    "شاغل", "حالت اشتغال", "خانه دار", "بازنشسته", "بیکار", "سایر"
]

OPTS_MARITAL_STATUS = [
    "مجرد", "نامزد", "عقد", "متاهل", "متارکه", "مطلقه", "بیوه"
]

OPTS_EDUCATION = [
    "زیر سن آموزش رسمی", "بی سواد", "پیش دبستانی", "ابتدایی",
    "راهنمایی", "دبیرستان", "دیپلم و پیش دانشگاهی",
    "دانشجو", "دارای مدرک دانشگاهی", "دارای مدرک حوزوی"
]

OPTS_MILITARY = [
    "آماده به خدمت", "در حین خدمت", "پایان خدمت", "معاف از خدمت"
]

OPTS_REFERRAL = [
    "روزنامه", "۱۱۸", "سایت", "بروشور یا پوستر",
    "کلاس‌های آموزش خانواده", "سخنرانی‌ها", "پیامک",
    "سایر مراجعان", "سایر موارد"
]
